main_menu1='''\n Главное меню:
 1. Открыть файл
 2. Выход
 \n'''

main_menu2='''\n Главное меню:
 1. Сохранить файл 
 2. Показать все контакты
 3. Добавить контакт
 4. Найти контакт
 5. Изменить контакт
 6. Удалить контакт
 7. Назад\n'''
input_choice="Выберите пункт меню:\n"

input_file="Введите название файла\n"

ready="Готово\n"

err="Ошибка\n"
write_name="Введите ФИО:  "
write_phone="Введите телефон:  "
write_comm="Введите комментарий:  "
search_contact="Введите ФИО:  "
order_number="Введите порядковый номер:  "